def 杯装之诗():
	up_five = ["温迪"]
	other_five = ["刻晴","莫娜","七七","迪卢克","琴"]
	up_four = ["砂糖","雷泽","诺艾尔"]
	ren_four = ["砂糖", "诺艾尔", "菲谢尔", "行秋", "香菱","雷泽", "芭芭拉", "重云", "班尼特", "凝光","辛焱","迪奥娜","北斗"]
	wuqi_four = ["弓藏", "绝弦", "昭心", "流浪乐章", "西风长枪","雨裁", "钟剑", "匣里龙吟", "笛剑", "祭礼弓","西风猎弓", "祭礼残章", "西风秘典", "匣里灭辰", "祭礼大剑","西风大剑", "祭礼剑", "西风剑"]
	return(up_five,other_five,up_four,ren_four,wuqi_four)
	
def 暂别冬都():		                
	up_five = ["公子"]
	other_five = ["刻晴","莫娜","七七","迪卢克","琴"]
	up_four = ["罗莎莉亚","芭芭拉","菲谢尔"]
	ren_four = ["砂糖", "诺艾尔", "菲谢尔", "行秋", "香菱","雷泽", "芭芭拉", "重云", "班尼特", "凝光","辛焱","迪奥娜","北斗"]
	wuqi_four = ["弓藏", "绝弦", "昭心", "流浪乐章", "西风长枪","雨裁", "钟剑", "匣里龙吟", "笛剑", "祭礼弓","西风猎弓", "祭礼残章", "西风秘典", "匣里灭辰", "祭礼大剑","西风大剑", "祭礼剑", "西风剑"]
	return(up_five,other_five,up_four,ren_four,wuqi_four)